import React, {useState} from 'react';
import s from './Conditions.module.scss';

const Conditions = () => {

    let [active,isActive] = useState(false)
    let toggleClass = () => {
        isActive(!active);
    }

    return (
        <div className={s.conditions}>
            <div className={s.title}>Умови</div>
            <ul>
                <hr className={s.line}/>
                <li onClick={toggleClass} className={active? `${s.li} ${s.active}`: s.li}>Доставка
                <span><h5>Зміни в період локдауну:</h5>
- відправки здійнюються три рази на тиждень
- безкоштовна доставка на відділення Нової Почти на замовлення від 1000 грн за умови повної передоплати
- безкоштовна доставка на адресу на замовлення від 1300 грн за умови повної передоплати
- безкоштовна доставка розпосвюджується тільки на роздрібні замовлення та не сумується з іншими знижками

<h5>Відправимо в будь-який куточок України.</h5>

<h5>Існує 2 способи доставки:</h5>

- Самовивіз
- Доставка Новою Поштою*

Відправка Новою поштою здійснюється кожен день, окрім вихідних, о 17:30.

Самовивіз здійснюється за попередньою домовленістю.

Відправка замовлення відбувається впродовж 1-2 днів з моменту внесення оплати/передоплати.**

В святкові періоди відправки здійснюються впродовж 1-3 днів з моменту оплати.

* оплата доставки не входить у вартість товару і оплачується отримувачем
** не розповсюджується на вихіні дні, випадки відсутності елементів у наявності, а також у інших випадках, що виключають можливість відправки день у день
*** при відправці Новою Поштою в літній період, шоколад може розтопитись під впливом температури повітря. Продавець не несе відповідальності за дані обставини
**** при відпраці Новою Поштою всі крихкі елементи упаковуються в пупирчату плівку</span></li>
                <hr className={s.line}/>
                <li className={active? `${s.li} ${s.active}`: s.li} onClick={toggleClass}>Оплата
                <span><h5>Існує 3 форми оплати:</h5>

- Готівковий розрахунок (тільки при самовивозі в м. Київ)
- Повна передоплата (переказ на картку повної суми)
- Часткова передоплата + накладений платіж (переказ на картку суми в розмірі 100 грн, а залишок при отриманні на відділенні Нової Пошти)*

* окремо оплачується комісія Нової Пошти за накладений платіж (20 грн + 2% сплаченої суми)</span></li>
                <hr className={s.line}/>
                <li className={active? `${s.li} ${s.active}`: s.li} onClick={toggleClass}>Обмін та повернення
                <span><h5>У випадку, якщо товар вам не підійшов або виявися бракованим - вихід є.</h5>

Для того, щоб здійнснити повернення чи обмін товару належної якості, переконайтесь у наступному:

- пройшло не більше 14 днів днів з моменту покупки (без врахування дня покупки);
- збережний товарний вигляд;
- товар не перебував у використанні;
- товар не входить в список товарів, що не підлягають поверненню відповідно до законодавства;
- в наявності вся комплектація товару, в тому числі упаковка без пошкоджень.

У випадку виявлення дефекту товару:

- Ми відповідаємо за якість нашої продукції, а тому безкоштовно зробимо обмін товару чи повернення коштів за нього у випадку виявлення на продукті значного виробничого браку чи дефекту;
- При відпраці транспортною компанією «Нова Пошта» кожна посилка страхується на повну суму вартості продукту. В цих випадках відповідальність за збередження цілісності товару несе транспортна компанія «Нова Пошта». Радимо оглянути посилку при її отриманні безпосредньо на відділенні Нової пошті, щоб переконатись у її цілісності. У разі виявлення слідів пошкоджень при транспортуванні, вкажіть про це працівнику Нової Пошти та складіть акт приойму-передачі та претензію.

Оформити обмін чи повернення можна декількома способами:

- Зателефонувати чи написати в Telegram/Viber за номером +38 (096) 689 84 07
- Написати на електронну пошту: tviy.box@gmail.com

* Поверненя товару відбувається у відповідності до Закону України «Про захист прав споживачів».
Всі транспортні витрати несе покупець.
Розгляд запиту про повернення відбувається впродовж 10 днів з моменту звернення.
В разі задоволення вашого запиту про повернення коштів, повернення відбувається впродовж 10 робочих днів.</span></li>
                <hr className={s.line}/>

            </ul>
        </div>
    );
};

export default Conditions;
